 Naive Bayes Classifier

In [80]:
import pandas as pd
df = pd.read_csv(r"C:\Users\isitt\ml\titanic.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [81]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [82]:
target=df.Survived
inputs = df.drop('Survived',axis='columns')

In [83]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [84]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [85]:
inputs.drop('Sex',axis = 'columns', inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [86]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [87]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [89]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.Age[:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [90]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [91]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [92]:
len(X_test)

179

In [93]:
len(X_train)

712

In [94]:
model.fit(X_train,y_train)

GaussianNB()

In [95]:
model.score(X_test,y_test)

0.8212290502793296

In [96]:
X_test[:10]

     Pclass        Age     Fare  female  male
752       3  33.000000   9.5000       0     1
313       3  28.000000   7.8958       0     1
739       3  29.699118   7.8958       0     1
593       3  29.699118   7.7500       1     0
511       3  29.699118   8.0500       0     1
840       3  20.000000   7.9250       0     1
375       1  29.699118  82.1708       1     0
590       3  35.000000   7.1250       0     1
789       1  46.000000  79.2000       0     1
855       3  18.000000   9.3500       1     0

In [97]:
y_test[:10]

752    0
313    0
739    0
593    0
511    0
840    0
375    1
590    0
789    0
855    1
Name: Survived, dtype: int64

In [98]:
model.predict(X_test[:10])

array([0, 0, 0, 1, 0, 0, 1, 0, 0, 1], dtype=int64)

In [99]:
model.predict_proba(X_test[:10])

array([[0.99013931, 0.00986069],
       [0.98976755, 0.01023245],
       [0.98990109, 0.01009891],
       [0.11026375, 0.88973625],
       [0.98991421, 0.01008579],
       [0.98837899, 0.01162101],
       [0.00153374, 0.99846626],
       [0.98992809, 0.01007191],
       [0.56676383, 0.43323617],
       [0.09390151, 0.90609849]])